## This is solved by using Pandas
1. Upload the dataset in Jupyter Notebook,
2. Load the dataset using the following code.

In [2]:
import pandas as pd
import numpy as np

In [3]:
scores = pd.read_excel("Score.xlsx", skipinitialspace=True)

3. Print the scores.

In [4]:
scores.head(6)

                  Name  English  Mathematics
0     Muhammad Abubakr       93           90
1          Yamna Tahir       90           45
2          Waqar - FTI       40           80
3  Khoulah Afzal Qamar       93           76
4       Ali Ibad Brohi       43           56
5       Maad Saifuddin       80           59

4. Set the name column as the index.

In [5]:
scores.set_index("Name", inplace=True)

In [6]:
scores.head(2)

                  English  Mathematics
Name
Muhammad Abubakr       93           90
Yamna Tahir            90           45

5. Convert the loaded data into a numpy array.

In [7]:
np_scores = np.array(scores)

6. Report the maximum score in English.

In [8]:
scores["English"].max()

93

7. Report the minimum score English.

In [20]:
scores["English"].min()

23

8. Report the maximum score in Mathematics.

In [22]:
scores["Mathematics"].max()

90

9. Report the minimum score in Mathematics.

In [23]:
scores["Mathematics"].min()

30

10. Sort the list by English scores.

In [25]:
scores.English.sort_values()

Name
Syed Ahmed Ali Naqvi        23
Muhammad Usama Ovais        38
Waqar - FTI                 40
Muhammad Sami Ullah Khan    40
Noman-Ul-Haq                42
Ali Ibad Brohi              43
Daniyal Khan                45
Hafiz Muhammad Shahid       47
Hassan Ahmed                71
M. Umair Munshi             73
Hussain Murtaza Ali         76
Qaisar Nisar                78
Maad Saifuddin              80
Uzair Irshad                86
Yamna Tahir                 90
Hamza Quaid Joher           90
Moiz Ali                    90
Muhammad Abubakr            93
Khoulah Afzal Qamar         93
Rama Abrik                  93
Name: English, dtype: int64

11. Sort the list by Mathematics scores.

In [26]:
scores.Mathematics.sort_values()

Name
Hassan Ahmed                30
Hussain Murtaza Ali         39
Syed Ahmed Ali Naqvi        40
Yamna Tahir                 45
Qaisar Nisar                45
Ali Ibad Brohi              56
Maad Saifuddin              59
Muhammad Usama Ovais        60
Muhammad Sami Ullah Khan    60
Daniyal Khan                70
Khoulah Afzal Qamar         76
Noman-Ul-Haq                78
Waqar - FTI                 80
Rama Abrik                  87
Moiz Ali                    87
Uzair Irshad                88
Hamza Quaid Joher           89
M. Umair Munshi             90
Hafiz Muhammad Shahid       90
Muhammad Abubakr            90
Name: Mathematics, dtype: int64

12. Find the mean score of each subject.

In [27]:
scores.English.mean()

66.55

In [29]:
scores.Mathematics.mean()

67.95

13. Filter the English scores that are greater than 90.

In [31]:
scores[scores.English>90]

                     English  Mathematics
Name
Muhammad Abubakr          93           90
Khoulah Afzal Qamar       93           76
Rama Abrik                93           87

14. Filter the Mathematics scores that are below 50.

In [32]:
scores[scores.Mathematics<50]

                      English  Mathematics
Name
Yamna Tahir                90           45
Hassan Ahmed               71           30
Qaisar Nisar               78           45
Syed Ahmed Ali Naqvi       23           40
Hussain Murtaza Ali        76           39

15. Find the correlation between the two subjects.

In [44]:
#????????
scores.corr()

              English  Mathematics   Science
English      1.000000     0.251862  0.077149
Mathematics  0.251862     1.000000  0.066249
Science      0.077149     0.066249  1.000000

16. Add another column to the numpy array with the heading Science and using
the random function generate 20 numbers between 0 and 100 and add them
to the Science column.

In [40]:
scores['Science'] = np.random.randint(0,100,20)

In [46]:
scores

                          English  Mathematics  Science
Name
Muhammad Abubakr               93           90       31
Yamna Tahir                    90           45       51
Waqar - FTI                    40           80       44
Khoulah Afzal Qamar            93           76       59
Ali Ibad Brohi                 43           56       91
Maad Saifuddin                 80           59        6
Hassan Ahmed                   71           30       41
Hamza Quaid Joher              90           89       28
M. Umair Munshi                73           90       20
Rama Abrik                     93           87       83
Qaisar Nisar                   78           45       63
Muhammad Sami Ullah Khan       40           60       65
Hafiz Muhammad Shahid          47           90       35
Syed Ahmed Ali Naqvi           23           40       18
Daniyal Khan                   45           70       56
Hussain Murtaza Ali            76           39       62
Uzair Irshad                   86           88       83
Noman-Ul-Haq                   42           78       73
Muhammad Usama Ovais           38           60       44
Moiz Ali                       90           87       79